In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler, RobustScaler, StandardScaler

import os
import env

In [3]:
import wrangle

wrangle.py functions loaded successfully.

In [4]:
df = wrangle.telco_data_two_year()
df.head()

,customer_id,monthly_charges,tenure,total_charges,contract_type_id,contract_type
0,0016-QLJIS,90.45,65,5957.9,3,Two year
1,0017-DINOC,45.20,54,2460.55,3,Two year
2,0019-GFNTW,45.05,56,2560.1,3,Two year
3,0056-EPFBG,39.40,20,825.4,3,Two year
4,0078-XZMHT,85.15,72,6316.2,3,Two year

In [5]:
# Aquire steps for initial visualization:

df.shape

(1695, 6)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       1695 non-null   object
 1   monthly_charges   1695 non-null   float64
 2   tenure            1695 non-null   int64
 3   total_charges     1695 non-null   object
 4   contract_type_id  1695 non-null   int64
 5   contract_type     1695 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 79.6+ KB

In [6]:
df.describe()

       monthly_charges       tenure  contract_type_id
count      1695.000000  1695.000000            1695.0
mean         60.770413    56.735103               3.0
std          34.678865    18.209363               0.0
min          18.400000     0.000000               3.0
25%          24.025000    48.000000               3.0
50%          64.350000    64.000000               3.0
75%          90.450000    71.000000               3.0
max         118.750000    72.000000               3.0

In [7]:
df[df.total_charges == " "].shape

(10, 6)

It appears there are 10 rows that are blank in the `total_charges` column. This makes sense since the tenure of these customers is 0, meaning they just started as customers. In the interest of keeping things clean, I'll opt to drop those rows by using the following code in the prep function:

> df2.drop(df2[df2['total_charges'] == " "].index, inplace = True)

This will allow me to completely ignore those missing values, and I can convert the rest of the column to a float.

In [8]:
df.head()

,customer_id,monthly_charges,tenure,total_charges,contract_type_id,contract_type
0,0016-QLJIS,90.45,65,5957.9,3,Two year
1,0017-DINOC,45.20,54,2460.55,3,Two year
2,0019-GFNTW,45.05,56,2560.1,3,Two year
3,0056-EPFBG,39.40,20,825.4,3,Two year
4,0078-XZMHT,85.15,72,6316.2,3,Two year

#### Takeaways:
- `total_charges` is an object; needs to be converted to a float.
- `contract_type_id` is a float, might need to be reorganized to a categorical value.
- `tenure` is in months currently. If I need to break things down by years, I'll need to create a new column that is something like round(tenure / 12, 0). I don't want decimals in my year column since the only reason to use a year would be to title or bin customers.
- Drop `total_charges` rows that are blank, since there are limited number of observations with missing values.
- All these changes need to take place in the prep file.

In [ ]:
df.drop(df[df['total_charges'] == " "].index, inplace = True)

In [ ]:
# Note there are 10 fewer rows than the last time I ran .shape. And the difference is 10 rows, which I identified
# above in the dataframe.

df.shape

In [ ]:
df.total_charges.dtype

In [ ]:
df['total_charges'] = df.total_charges.astype('float')

In [ ]:
df.total_charges.dtype

In [ ]:
df.shape

In [ ]:
df['total_charges'] = pd.to_numeric(df['total_charges'], downcast = 'float')

In [ ]:
df.total_charges.dtype

In [ ]:
def prep_acquired_telco(df):
    '''
    This function will both acquire and prep the modified telco dataset (only 2-yr contracts)
    and return the train, validate, and test datasets. It will read off a .csv that is in the working directory
    if it exists, otherwise the function will pull the data from the Codeup db.
    '''
    
    # Cleaning the total_costs column by dropping empty values:
    df.drop(df[df['total_charges'] == " "].index, inplace = True)
    
    # Changing the total_costs column to a float:
    df['total_charges'] = df.total_charges.astype('float')
    
    # Finally, splitting my data based on the target variable of tenure:
    
    train_validate, test = train_test_split(df, test_size=.15, 
                                            random_state=123)
    
    # Splitting the train_validate set into the separate train and validate datasets.
    train, validate = train_test_split(train_validate, test_size=.15, 
                                   random_state=123)
    print(f'Shape of train df: {train.shape}')
    print(f'Shape of validate df: {validate.shape}')
    print(f'Shape of test df: {test.shape}')
    return train, validate, test

In [9]:
def prep_acquired_telco(df):
    '''
    This function will both acquire and prep the modified telco dataset (only 2-yr contracts)
    and return the train, validate, and test datasets. It will read off a .csv that is in the working directory
    if it exists, otherwise the function will pull the data from the Codeup db.
    '''
    # First, I need to acquire the dataframe within this function:
    df = pd.read_csv('telco_customers_df_two_year.csv', index_col = 0)

    
    # Cleaning the total_costs column by dropping empty values:
    df.drop(df[df['total_charges'] == " "].index, inplace = True)
    
    # Changing the total_costs column to a float:
    df['total_charges'] = df.total_charges.astype('float')
    
    # Finally, splitting my data based on the target variable of tenure:
    
    train_validate, test = train_test_split(df, test_size=.15, 
                                            random_state=123)
    
    # Splitting the train_validate set into the separate train and validate datasets.
    train, validate = train_test_split(train_validate, test_size=.15, 
                                   random_state=123)
    print(f'Shape of train df: {train.shape}')
    print(f'Shape of validate df: {validate.shape}')
    print(f'Shape of test df: {test.shape}')
    return train, validate, test

In [10]:
train, validate, test = prep_acquired_telco(df)

Shape of train df: (1217, 6)
Shape of validate df: (215, 6)
Shape of test df: (253, 6)

In [11]:
train

,customer_id,monthly_charges,tenure,total_charges,contract_type_id,contract_type
1050,9861-PDSZP,108.05,72,7806.60,3,Two year
971,8041-TMEID,108.50,63,6991.90,3,Two year
590,9443-JUBUO,65.25,72,4478.85,3,Two year
588,9415-ZNBSX,89.00,70,6293.20,3,Two year
1322,3976-HXHCE,19.30,72,1414.80,3,Two year
...,...,...,...,...,...,...
1218,2481-SBOYW,25.00,61,1498.35,3,Two year
355,5915-ANOEI,79.15,70,5536.50,3,Two year
1085,0505-SPOOW,19.80,70,1397.65,3,Two year
613,9795-NREXC,85.00,64,5484.40,3,Two year
215,3704-IEAXF,53.65,72,3784.00,3,Two year

In [ ]:
df3 = pd.read_csv('telco_customers_df_two_year.csv', index_col = 0)
df3

# Putting it all together

In [ ]:
def prep_acquired_telco(df, target):
    '''
    This function will both acquire and prep the modified telco dataset (only 2-yr contracts)
    and return the train, validate, and test datasets. It will read off a .csv that is in the working directory
    if it exists, otherwise the function will pull the data from the Codeup db.
    '''
    # First, I need to acquire the dataframe within this function:
    df = pd.read_csv('telco_customers_df_two_year.csv', index_col = 0)

    
    # Cleaning the total_costs column by dropping empty values:
    df.drop(df[df['total_charges'] == " "].index, inplace = True)
    
    # Changing the total_costs column to a float:
    df['total_charges'] = df.total_charges.astype('float')
    
    # Finally, splitting my data based on the target variable of tenure:
    
    train_validate, test = train_test_split(df, test_size=.15, 
                                            random_state=123)
    
    # Splitting the train_validate set into the separate train and validate datasets.
    train, validate = train_test_split(train_validate, test_size=.15, 
                                   random_state=123)
    print(f'Shape of train df: {train.shape}')
    print(f'Shape of validate df: {validate.shape}')
    print(f'Shape of test df: {test.shape}')
    return train, validate, test

In [7]:
path = 'student-mat.csv'

In [8]:
# Example all together function:

def wrangle_student_math(path):
    df = pd.read_csv(path, sep=";")
    
    # drop any nulls
    df = df[~df.isnull()]

    # get object column names
    object_cols = get_object_cols(df)
    
    # create dummy vars
    df = create_dummies(df, object_cols)
      
    # split data 
    X_train, y_train, X_validate, y_validate, X_test, y_test = train_validate_test(df, 'G3')
    
    # get numeric column names
    numeric_cols = get_numeric_X_cols(X_train, object_cols)

    # scale data 
    X_train_scaled, X_validate_scaled, X_test_scaled = min_max_scale(X_train, X_validate, X_test, numeric_cols)
    
    return df, X_train, X_train_scaled, y_train, X_validate_scaled, y_validate, X_test_scaled, y_test

In [9]:
# And how it was called:
df, X_train_explore, \
    X_train_scaled, y_train, \
    X_validate_scaled, y_validate, \
    X_test_scaled, y_test = wrangle.wrangle_student_math(path)

In [10]:
X_train_scaled.head()

,age,Medu,Fedu,traveltime,studytime,failures,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2
142,0.000000,1.00,1.00,0.000000,0.666667,0.000000,0.75,0.25,0.25,0.00,0.00,1.00,0.035714,0.357143,0.578947
326,0.333333,0.75,0.75,0.000000,0.000000,0.000000,0.75,0.50,1.00,0.50,1.00,1.00,0.053571,0.714286,0.789474
88,0.166667,0.50,0.50,0.333333,0.333333,0.333333,0.75,0.75,0.25,0.00,0.00,0.50,0.214286,0.500000,0.526316
118,0.333333,0.25,0.75,0.666667,0.333333,0.333333,1.00,0.25,0.75,0.00,0.75,1.00,0.357143,0.357143,0.368421
312,0.666667,0.25,0.50,0.000000,0.333333,0.333333,0.75,1.00,0.25,0.25,0.25,0.75,0.053571,0.642857,0.578947

In [11]:
y_train.head()

142    11
326    16
88     10
118     8
312    11
Name: G3, dtype: int64

In [12]:
path = 'telco_customers_df_two_year.csv'